In [7]:
import pandas as pd

In [8]:
import numpy as np

In [9]:
df=pd.DataFrame(np.arange(3),index=None)
df

   0
0  0
1  1
2  2

# Create series from dictionary

In [10]:
dictionary=[
    {"Name":"A","Age":23,"Location":"Mysore"},
    {"Name":"B","Age":24,"Location":"Simikot"},
    {"Name":"C","Age":23,"Location":"Coimbatore"},
]

df=pd.DataFrame(dictionary)
df

  Name  Age    Location
0    A   23      Mysore
1    B   24     Simikot
2    C   23  Coimbatore

In [11]:
df

  Name  Age    Location
0    A   23      Mysore
1    B   24     Simikot
2    C   23  Coimbatore

In [12]:
df=pd.read_csv("../Sample Data/housing.csv")
df2=df.copy()
df2['longitude1']=df['longitude']
df2

FileNotFoundError: [Errno 2] No such file or directory: '../Sample Data/housing.csv'

In [ ]:
df2.describe()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,longitude1
count,20640.000000,20640.000000,20640.000000,20640.000000,20433.000000,20640.000000,20640.000000,20640.000000,20640.000000,20640.000000
mean,-119.569704,35.631861,28.639486,2635.763081,537.870553,1425.476744,499.539680,3.870671,206855.816909,-119.569704
std,2.003532,2.135952,12.585558,2181.615252,421.385070,1132.462122,382.329753,1.899822,115395.615874,2.003532
min,-124.350000,32.540000,1.000000,2.000000,1.000000,3.000000,1.000000,0.499900,14999.000000,-124.350000
25%,-121.800000,33.930000,18.000000,1447.750000,296.000000,787.000000,280.000000,2.563400,119600.000000,-121.800000
50%,-118.490000,34.260000,29.000000,2127.000000,435.000000,1166.000000,409.000000,3.534800,179700.000000,-118.490000
75%,-118.010000,37.710000,37.000000,3148.000000,647.000000,1725.000000,605.000000,4.743250,264725.000000,-118.010000
max,-114.310000,41.950000,52.000000,39320.000000,6445.000000,35682.000000,6082.000000,15.000100,500001.000000,-114.310000

In [ ]:
df2.index

RangeIndex(start=0, stop=20640, step=1)

In [ ]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20640 entries, 0 to 20639
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           20640 non-null  float64
 1   latitude            20640 non-null  float64
 2   housing_median_age  20640 non-null  float64
 3   total_rooms         20640 non-null  float64
 4   total_bedrooms      20433 non-null  float64
 5   population          20640 non-null  float64
 6   households          20640 non-null  float64
 7   median_income       20640 non-null  float64
 8   median_house_value  20640 non-null  float64
 9   ocean_proximity     20640 non-null  object
 10  longitude1          20640 non-null  float64
dtypes: float64(10), object(1)
memory usage: 1.7+ MB

In [ ]:
list_of_list=[['Hi',10],['Hello',20],['Bye',30]]
df=pd.DataFrame(list_of_list,columns=['Name','Age'],index=['A','B','C'])
df

    Name  Age
A     Hi   10
B  Hello   20
C    Bye   30

In [ ]:
tuple_of_tuple=(('Hello',21),('Hi',22),('Bye',23))
df=pd.DataFrame(tuple_of_tuple,columns=['Name','Age'])
df

    Name  Age
0  Hello   21
1     Hi   22
2    Bye   23

# loc

In [ ]:
# single row
df.loc[0]

Name    Hello
Age        21
Name: 0, dtype: object

In [ ]:
# multiple row
df.loc[[0,1,2]] # syntax df.loc[[list of rows]]

    Name  Age
0  Hello   21
1     Hi   22
2    Bye   23

In [ ]:
# multiple row
df.loc[0:1] # syntax df.loc[start row:end row]

    Name  Age
0  Hello   21
1     Hi   22

In [ ]:
# single column 
df.loc[0:1,'Age']

0    21
1    22
Name: Age, dtype: int64

In [ ]:
# multiple column 
df.loc[:,['Name','Age']] # syntax df.loc[[selected rows list], [selected columns list]]

    Name  Age
0  Hello   21
1     Hi   22
2    Bye   23

# Change index

In [ ]:
df1=df.set_index('Name') # set_index return a new data set
df1

       Age
Name
Hi      10
Hello   20
Bye     30

In [ ]:
df2.iloc[:,1]

0        37.88
1        37.86
2        37.85
3        37.85
4        37.85
         ...
20635    39.48
20636    39.49
20637    39.43
20638    39.43
20639    39.37
Name: latitude, Length: 20640, dtype: float64

In [ ]:
df.iloc[0:1,0:1]

  Name
A   Hi

# column rename

In [ ]:
df2=df.rename(columns={'Age':'AGE'})

In [ ]:
df2

    Name  AGE
A     Hi   10
B  Hello   20
C    Bye   30

# column delete

In [ ]:
df3=df2.drop('Name',axis=1)
df3

   AGE
A   10
B   20
C   30

# row delete

In [ ]:
df4=df.drop('A',axis=0)
df4

    Name  Age
B  Hello   20
C    Bye   30

# assigning value

In [ ]:
df.loc['B','Name']="Hi"
df

  Name  Age
A   Hi   10
B   Hi   20
C  Bye   30

# iteration

In [ ]:
for i,series in df.iterrows():
    print(i,series)

A Name    Hi
Age     10
Name: A, dtype: object
B Name    Hi
Age     20
Name: B, dtype: object
C Name    Bye
Age      30
Name: C, dtype: object

In [ ]:
for i in df.itertuples(index=False):
    print(i)

Pandas(Name='Hi', Age=10)
Pandas(Name='Hi', Age=20)
Pandas(Name='Bye', Age=30)

# Sorting

In [ ]:
df5=df.sort_values('Age')

In [ ]:
df5

  Name  Age
A   Hi   10
B   Hi   20
C  Bye   30

In [ ]:
df.sort_values('Age',ascending=False)

  Name  Age
C  Bye   30
B   Hi   20
A   Hi   10

# filtering

In [ ]:
df.loc[(df['Age']<30) & (df['Age']>10)]

  Name  Age
B   Hi   20

# Practice: https://leetcode.com/problems/big-countries/

In [ ]:
# solution
import pandas as pd

def big_countries(world: pd.DataFrame) -> pd.DataFrame:
    ans=world.loc[(world['area']>=3000000) | (world['population']>=25000000)]
    
    return ans.loc[:,['name','population','area']]

# Practice https://leetcode.com/problems/recyclable-and-low-fat-products/description/

In [ ]:
import pandas as pd

def find_products(products: pd.DataFrame) -> pd.DataFrame:
    ans=products.loc[(products['low_fats']=="Y") & (products['recyclable']=="Y")]
    return ans.loc[:,['product_id']]